04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/boxTurb16/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [kinematicPressure];

internalField   uniform 0;

boundaryField
{
    patch0_half0
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
